baseCases/stacked/constant/air/thermophysicalProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object thermophysicalProperties;
}

mixture
{
  equationOfState
  {
    rho         rho     [ 1 -3 0 0 0 0 0 ]      1.2486254378144424 ;            // kg/m3
  }
  transport
  {
    lambda      lambda  [ 1 1 -3 -1 0 0 0 ]     0.024817630427238658 ;          // W/mK
    TDiff       TDiff   [ 0 2 -1 0 0 0 0 ]      1.9762041045699644e-05 ;        // m2/s
    cwDiff      cwDiff  [ 0 2 -1 0 0 0 0 ]      2.5e-05 ;                       // m2/s
    p0          p0      [ 1 -1 -2 0 0 0 0 ]     100000.0 ;                      // Pa
    beta        beta    [ 0 0 0 0 0 0 0 ]       0.6225 ;                        // 1
    nu          nu      [ 0 2 -1 0 0 0 0 ]      1.3849449977234775e-05 ;        // m2/s
  }
  humidity
  {
    deltaH      deltaH  [ 0 2 -2 0 0 0 0 ]      2486668.4761320855 ;            // J/kg
  }
}



// ************************************************************************* //
