baseCases/stacked/system/air/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}

vertices
  (
    (0 0.003 0)
    (0 0.003 0.0001)
    (0 0.00275 0)
    (0 0.00275 0.0001)
    (0 0.00225 0)
    (0 0.00225 0.0001)
    (0 0.00075 0)
    (0 0.00075 0.0001)
    (0 0.00025 0)
    (0 0.00025 0.0001)
    (0 0 0)
    (0 0 0.0001)
    (0.02 0.003 0)
    (0.02 0.003 0.0001)
    (0.02 0.00275 0)
    (0.02 0.00275 0.0001)
    (0.02 0.00225 0)
    (0.02 0.00225 0.0001)
    (0.02 0.00075 0)
    (0.02 0.00075 0.0001)
    (0.02 0.00025 0)
    (0.02 0.00025 0.0001)
    (0.02 0 0)
    (0.02 0 0.0001)
    (0.04 0.003 0)
    (0.04 0.003 0.0001)
    (0.04 0.00275 0)
    (0.04 0.00275 0.0001)
    (0.04 0.00225 0)
    (0.04 0.00225 0.0001)
    (0.04 0.00075 0)
    (0.04 0.00075 0.0001)
    (0.04 0.00025 0)
    (0.04 0.00025 0.0001)
    (0.04 0 0)
    (0.04 0 0.0001)
    (0.06 0.003 0)
    (0.06 0.003 0.0001)
    (0.06 0.00275 0)
    (0.06 0.00275 0.0001)
    (0.06 0.00225 0)
    (0.06 0.00225 0.0001)
    (0.06 0.00075 0)
    (0.06 0.00075 0.0001)
    (0.06 0.00025 0)
    (0.06 0.00025 0.0001)
    (0.06 0 0)
    (0.06 0 0.0001)
  );

edges
  (
  );

blocks
  (
    hex

    (
      10
      22
      20
      8
      11
      23
      21
      9
    )
    (467 6 1)
    simpleGrading
    (1 1 1)
    hex

    (
      8
      20
      18
      6
      9
      21
      19
      7
    )
    (467 12 1)
    simpleGrading
    (1 1 1)
    hex

    (
      6
      18
      16
      4
      7
      19
      17
      5
    )
    (467 34 1)
    simpleGrading
    (1 1 1)
    hex

    (
      18
      30
      28
      16
      19
      31
      29
      17
    )
    (467 34 1)
    simpleGrading
    (1 1 1)
    hex

    (
      16
      28
      26
      14
      17
      29
      27
      15
    )
    (467 12 1)
    simpleGrading
    (1 1 1)
    hex

    (
      14
      26
      24
      12
      15
      27
      25
      13
    )
    (467 6 1)
    simpleGrading
    (1 1 1)
    hex

    (
      34
      46
      44
      32
      35
      47
      45
      33
    )
    (467 6 1)
    simpleGrading
    (1 1 1)
    hex

    (
      32
      44
      42
      30
      33
      45
      43
      31
    )
    (467 12 1)
    simpleGrading
    (1 1 1)
    hex

    (
      30
      42
      40
      28
      31
      43
      41
      29
    )
    (467 34 1)
    simpleGrading
    (1 1 1)
  );

boundary
  (
    inlet

    {
      faces
        (

          (
            10
            8
            9
            11
          )

          (
            8
            6
            7
            9
          )

          (
            6
            4
            5
            7
          )
        );
      type patch;

    }
    outlet

    {
      faces
        (

          (
            46
            44
            45
            47
          )

          (
            44
            42
            43
            45
          )

          (
            42
            40
            41
            43
          )
        );
      type patch;

    }
    top_bottom

    {
      faces
        (

          (
            10
            22
            20
            8
          )

          (
            8
            20
            18
            6
          )

          (
            6
            18
            16
            4
          )

          (
            11
            23
            21
            9
          )

          (
            9
            21
            19
            7
          )

          (
            7
            19
            17
            5
          )

          (
            18
            30
            28
            16
          )

          (
            16
            28
            26
            14
          )

          (
            14
            26
            24
            12
          )

          (
            19
            31
            29
            17
          )

          (
            17
            29
            27
            15
          )

          (
            15
            27
            25
            13
          )

          (
            34
            46
            44
            32
          )

          (
            32
            44
            42
            30
          )

          (
            30
            42
            40
            28
          )

          (
            35
            47
            45
            33
          )

          (
            33
            45
            43
            31
          )

          (
            31
            43
            41
            29
          )
        );
      type patch;

    }
    air_to_solution1

    {
      faces
        (

          (
            4
            16
            17
            5
          )
        );
      type patch;

    }
    air_to_solution2

    {
      faces
        (

          (
            18
            30
            31
            19
          )
        );
      type patch;

    }
    air_to_solution3

    {
      faces
        (

          (
            28
            40
            41
            29
          )
        );
      type patch;

    }
    symmetry1

    {
      faces
        (

          (
            10
            22
            23
            11
          )
        );
      type symmetry;

    }
    symmetry2

    {
      faces
        (

          (
            12
            24
            25
            13
          )
        );
      type symmetry;

    }
    symmetry3

    {
      faces
        (

          (
            34
            46
            47
            35
          )
        );
      type symmetry;

    }
    wall

    {
      faces
        (

          (
            22
            20
            21
            23
          )

          (
            20
            18
            19
            21
          )

          (
            16
            14
            15
            17
          )

          (
            14
            12
            13
            15
          )

          (
            34
            32
            33
            35
          )

          (
            32
            30
            31
            33
          )

          (
            28
            26
            27
            29
          )

          (
            26
            24
            25
            27
          )
        );
      type patch;

    }
  );

mergePatchPairs
  (
  ); 	// ************************************************************************* //

