baseCases/stacked/system/air/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/air";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        // solver          PCG;
        // preconditioner  DIC;
        // tolerance       1e-7;
        // relTol          0.01;
        // maxIter         300;
        solver                  GAMG;
        tolerance               1e-6;
        relTol                  0.01;
        smoother                GaussSeidel;
        nPreSweeps              0;
        nPostSweeps             2;
        cacheAgglomeration      on;
        agglomerator            faceAreaPair;
        nCellsInCoarsestLevel   1000;
        mergeLevels             1;
        // minIter                 3;
    }
    pFinal
    {
        $p;
        relTol                  0;
    }

    U
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-5;
        relTol           0;
    }
    UFinal
    {
        $U;
        tolerance        1e-6;
    }
    "(T|cw)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-6;
        relTol           0;
    }
}

SIMPLE
{ 
}

PIMPLE
{
    momentumPredictor           on;
    nCorrectors                 3;
    nNonOrthogonalCorrectors    1;
    
    outerCorrectorResidualControl
    {
        U       
        {
            tolerance   1e-3;
            relTol      0;
        }
        p       
        {
            tolerance   5e-6;
            relTol      0;
        }
    }
}

probesControl
{
    doProbesControl false;
    probeLocations
    (
        (0.05 0.001 0.025)
        (0.07 0.001 0.025)
        (0.09 0.001 0.025)
    );
}

HMT
{
    residualControl
    {
        T       1e-6;
        cw      1e-6; 
    }
}

relaxationFactors
{
    fields
    {
        cw      0.5;
        T       0.5;
        // p       0.3;
        // pFinal  1;
    }

    equations
    {
        // U       0.7;
        // UFinal  1;
    }
}


// ************************************************************************* //
