baseCases/stacked/system/air/setFieldsDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object setFieldsDict;
}

defaultFieldValues
  (
    volScalarFieldValue
    cellDist
    0
  );

regions
  (
    boxToCell

    {
      box (0 -1 0.00021) (1 1 0.00041) ;
      fieldValues
        (
          volScalarFieldValue
          cellDist
          1
        );

    }
    boxToCell

    {
      box (0 -1 0.00041) (1 1 0.00061) ;
      fieldValues
        (
          volScalarFieldValue
          cellDist
          2
        );

    }
    boxToCell

    {
      box (0 -1 0.00061) (1 1 0.00081) ;
      fieldValues
        (
          volScalarFieldValue
          cellDist
          3
        );

    }
    boxToCell

    {
      box (0 -1 0.00081) (1 1 0.00101) ;
      fieldValues
        (
          volScalarFieldValue
          cellDist
          4
        );

    }
  ); 	// ************************************************************************* //

